Revit 2024 API
BendingDetailCustomFieldMultipleValuesIndicatorOptions Enumeration
 Describes how the parameters with multiple values will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailCustomFieldMultipleValuesIndicatorOptions
Visual Basic
Public Enumeration BendingDetailCustomFieldMultipleValuesIndicatorOptions
Visual C++
public enum class BendingDetailCustomFieldMultipleValuesIndicatorOptions
Members
Member name | Description
Varying |  The values will be obtained from all included bars in the rebar set and it will be shown the multiple varies indicator if they are different.
MinimumMaximum |  The values will be obtained from all included bars in the rebar set and it will be shown in a form like minimumValue...maximumValue.
See Also
Autodesk.Revit.DB.Structure Namespace